'''
виконайте добуток двох квадратних матриць 3*3, врахуйте розмірність.
Результати множення елементів занесіть до нової матриці та виведіть її на екран;
'''

from random import randint
a = [[randint(-10,10), randint(-10,10), randint(-10,10)],
     [randint(-10,10), randint(-10,10), randint(-10,10)],
     [randint(-10,10), randint(-10,10), randint(-10,10)]]
b = [[randint(-10,10), randint(-10,10), randint(-10,10)],
     [randint(-10,10), randint(-10,10), randint(-10,10)],
     [randint(-10,10), randint(-10,10), randint(-10,10)]] #генеруємо дві матриці 3*3 (як список)
a = np.array(a)
b = np.array(b) # перетворюємо списки в масиви
el_c = 0 # елемент тимчасової матриці
t = [] # тимчасова матриця
c = [] # вихідна матриця
if len(a) != len(b[0]): #перевіряємо можливість множення
    print('Неможливо перемножити матриці')
else:
    for i in range(len(a)): #len(a) - к-сть рядків в першій матиці
        for j in range(len(b[0])): # len(b[0]) - к-сть стовпчиків в другій матиці
            for k in range(len(a[0])): #len(a[0]) - к-сть стовпчиків в першій матиці
                el_c += a[i][k] * b[k][j]
                '''
                по елементно множими і сумуємо кожен елемент рядка на
                кожен елемент стовпчика і додаємо їх
                '''
            t.append(el_c) # додаємо елемент в тимчасову матрицю
            el_c = 0 # обнуляємо змінну
        c.append(t) # додаємо тимчасову матрицю в вихідну
        t = []
    for i in range(len(c)):
        for j in range(len(c)):
            print(c[i][j],end=' ')
        print()