'''
Бінарний пошук
'''
from random import randint
a = [randint(-10,10) for i in range(10)] # список із 9 елементів
a.sort() # сортування списку
x = int(input('Введіть шукане число: ')) # шукане значення
m = len(a)//2 # середній елемент
l = 0 # пеший елемент
h = len(a)-1 #останній елемент
while a[m] != x and l <= h: # задаємо умову і зациклюємо прграму аж до знаходження числа
    if x > a[m]:
        l = m + 1
        '''якщо шукане число білше середньго елемента - ліва частина відпадає і нижня межа дорівнює наступному від
        середньго значенню'''
    else:
        h = m - 1
        '''якщо шукане число менше середньго елемента - права частина відпадає і верхня межа дорівнює попердньому від
                середньго значенню'''
    m = (l + h) // 2 #вираховується нове середнє значення і програма виконується знову
if l > h:
    print("Немає збігів")
else:
    print("Індекс шуканого числа в списку =", m)
print(a)