'''
Лінійний пошук
'''
from random import randint
a = [randint(-10,10) for i in range(10)] # генеруємо список
x = int(input('Введіть шукане число: ')) # користувач вводить шукане число
n = len(a) # присвоюємо змінній значення довжини списка
b = 0 # лічильник перевірок
for i in range(len(a)):
    b += 1 # при кожній ітерації змінна збільшується на 1
    if a[i] == x:
        print('Елемент знайдено')
        print('Виконано перевірок:',b) # якщо є збіг, то перевірка закінчується і виводиться на екран кількість перевірок
        break
    elif b == n:
            print('Елементів немає')
            print('Виконано перевірок:', b) # якщо кількість перевірок дорівнює довжині списка, то збігів немає
            break