'''
Пошук підрядка в рядку
'''
a = input('Введіть рядок: ') #вводимо рядок
b = input('Введіть шуканий підрядок: ') #вводимо шуканий підрядок
i = a.find(b)
k = 0
if i >= 0: #функція find поветрає індекс елемента або -1, якщо збігів немає
    print(f'Збіг знайдено на {i} позиції')
    k = i+len(b)
    '''
    к-сть перевірок дорівнює: індексу знайденого елеманта + довжина шуканого рядка,
    тому що програма не зупитається на знаходжені збігу першого елемента
    '''
    if k == 1:
        print(f'Зроблено {k} перевірку')
    elif 1 < k < 5:
        print(f'Зроблено {k} перевірки')
    else:
        print(f'Зроблено {k} перевірок')
else:
    print('Збігів немає')
    print(f'Зроблено {len(a)} перевірок')